  以下の条件に同意し、遵守していただける場合にのみこのソフトウェアの
使用を認めます。このソフトウェアを使用しているという事実は、同意し、
遵守する意志があるものと解釈します。

    DENTAKU ソフトウェア使用条件

　1.  このソフトウェアはボランティアによって作成されたものである。
　　　従って、作者はこのソフトウェアを使用した結果生じた損害その他一
　　　切に関して責任を持たない。また、動作に関しても保証しない。

  2.  このソフトウェアの使用に際して添付されたソースコードやドキュメ
      ント以上の正式なサポートはない。ネットワーク上で行われるものな
      どはすべて善意によるものであり、作者の義務ではない。

  3.  このソフトウェアは添付されたファイルの全てをそのまま再配布する
      場合は、以下の条件に反しない限り無制限に認める。

         i) 再配布を防げないこと。
        ii) 改変していないこと。
       iii) 実費を越える金品の授受を伴わないこと。

  4.  このソフトウェアに添付されたファイルの一部を改変したものを発行
      する場合は、以下の条件に従うこと。

         i) 再配布を防げないこと。
        ii) 故意の改悪やコンピューターやネットワークにとって有害な改
            変、恣意的な改変が行われていないこと。
       iii) 改変物であることおよび改変の箇所、意図が明確にわかるよう
            になっていること。
        iv) 発行に際して金品の授受が無いこと。
         v) 権利に関する表示を改変したり取り去ったりしないこと。
        vi) 事前に作者が同様の改変を行っていないか確認すること。 

  5.  このソフトウェアに添付されたソースコード等の一部を再利用する場
      合は、以下の条件に従うこと。

         i) コンピューターやネットワークに悪影響を及ぼすものへ使用し
            ないこと。
        ii) 権利に関する表示を改変したり取り去ったりしないこと。
       iii) 修正、改良に関しては 4 の ii に従うものとする。

  6.  個人的な使用にかぎり、このソフトウェアを自由に改変することを認
      める。

  7.  これらの条項を取り去ったり、改変しないこと。


  このソフトウェア及びドキュメント類一式全てに関する権利は鈴木隆史
(wex@jf7wex.sdj.miyagi.prug.or.jp -- 1992 年 5 月現在有効) に属しま
す。ただし、一部 kamide@js1cpw.ymt.prug.or.jp さんによる寺子屋関連ソ
フトウェアから再利用したコードがあり、同氏の承諾を得ています。また、
SOROBAN のソースコードも一部利用しています。これらの部分に関しては権
利は原作者が保留しています。
  また、ei@focgw.jp1foc.ymt.prug.or.jp さんによる network.def ライブ
ラリも利用しています。
(c) 1992 Ryuji Suzuki.
(c) 1988 - 1992 Sigeki Matsushima, Dai Yokota, Akihiko Taniguchi,
                Akiyoshi Kamide.
(c) 1991 HOSAKA, E., JP1FOC
